{
  "title": "Le Labo d'essais JavaScript",
  "description": "Le programme TwilioQuest maintient cette installation de recherche de haute technologie qui étudie les dernières avancées de la technologie JavaScript. Ils ont demandé à un agent de visiter la station et de contrôler son niveau de sécurité.",
  "questTitle": "Le Labo d'essais JavaScript",
  "questDescription": "Enquêtez sur la station et aidez l'équipe de recherche !",
  "navMap": {
    "x": 25,
    "y": 25,
    "sprite": "nav_map/javascript_lab.png"
  },
  "is_mission": false,
  "priority": 3,
  "backgroundMusic": "fascinatingarea_108253b",
  "backgroundEffect": {
    "key": "starfield",
    "options": { "baseSpeed": 0.03, "direction": "rightToLeft" }
  },
  "flavorTextOverrides": {
    "bookshelf" : "Hmmm... Il y a beaucoup de classiques ici. \"You Don't Know JS\", \"JavaScript : The Good Parts\", et un tas d'autres.",
    "ducktypium" : " Waouh, c'est du pur Ducktypium. Puissant, mais hautement instable. Si le JavaScript de ce labo est alimenté par ce truc, pas étonnant qu'il y ait de temps en temps des réclamations d'assurance.",
    "passwordDeskNote" : "Écrit sur un post-it sur son bureau. \"Mot de passe du rayon de stase : <span class=\"highlight\">PEW PEW PEW!</span>\"",
    "officeTerminal" : "Cet écran surveille la température de la pièce Ducktypium. Il fait une température agréable de 21°C.",
    "officeBookshelf" : "Il y a beaucoup de cahiers d'expériences différentes ici. Mutations, transformations, prototypes, et d'autres choses encore.",
    "opensMar2020" : "L'aventure se poursuit ainsi en <span class=\"highlight\">début mai 2020</span> - revenez plus tard dans le mois, <a href=\"https://twitter.com/TwilioQuest\">suivez Cédric sur Twitter</a>, et <a href=\"https://www.twilio.com/quest#email\">inscrivez-vous à notre newsletter</a> pour être les premiers informés de l'ouverture de cette zone !",
    "playerPlantedTree" : "Votre propre arbre ! Il s'agit d'un arbre réel qui sera planté en Australie pour aider le pays à se remettre des récents incendies qui y ont sévi.",
    "loopLockInfo" : "Cette étrange pièce affiche un numéro, tout comme les numéros à l'extérieur des soutes sécurisées du vaisseau. Je me demande s'ils sont connectés ? Je devrais <span class=\"highlight\">faire un tour dans cette pièce</span> pour voir ce qui se passe...",
    "infiniteLoopNotReady" : "Le vaisseau scientifique le \"Infinite Loop\" aurait dû être amarré ici ! Je dois <span class=\"highlight\">attendre une nouvelle mise à jour du jeu</span> pour finir de sauver ce scientifique."
  },
  "objectives": [
    "js_node_env_setup",
    "classes",
    "fizzBuzz",
    "instantiation",
    "js_basics_cli_args",
    "js_declare_function",
    "js_declare_variable",
    "js_enable_laser",
    "js_function_arguments",
    "js_declare_variable_multiple",
    "js_node_workspace",
    "js_north_bridge",
    "js_scientist_bridge",
    "js_south_bridge",
    "js_split_north_laser",
    "js_split_south_laser",
    "js_unlock_door",
    "js_west_bridge"
  ]
}
